package czy.spring.boot.starter.common.constant;

/* 正则表达式常量 */
public class RegexConstant {

    /**
     * 正则表达式:验证用户名，长度6-12，可以包含大小写字母、数字、下划线，首字母不能为数字、下划线
     */
    public static final String REGEX_USERNAME = "^[a-zA-Z]\\w{5,11}$";

    /**
     * 正则表达式:验证密码(不包含特殊字符)，6-16位，包含大小写字母与数字
     */
    public static final String REGEX_PASSWORD = "^[a-zA-Z0-9]{6,16}$";

    /**
     *说明：移动：134、135、136、137、138、139、150、151、157(TD)、158、159、187、188
     * 联通：130、131、132、152、155、156、185、186
     * 电信：133、153、180、189
     * 总结起来就是第一位必定为1，第二位必定为3或5或8，其他位置的可以为0-9
     */
    public static final String REGEX_PHONE = "^(13|15|18)[0-9]{9}$";

    /**
     * 固定电话号码校验
     * (^0[1,2]{1}\\d{1}-?\\d{8}$)：这是01、02开头的固话的验证规则，前三位是区号，后八位是电话号码
     * (^0[3-9] {1}\\d{2}-?\\d{7,8}$)：这是03-09开头的固话的验证规则，前四位是区号，后七八位是电话号码
     * (^0[1,2]{1}\\d{1}-?\\d{8}-(\\d{1,4})$)：后面四位是分机号码
     * (^0[3-9]{1}\\d{2}-? \\d{7,8}-(\\d{1,4})$)：后面四位是分机号码
     */
    public static final String REGEX_MOBILE = "((^0[1,2]{1}\\d{1}-?\\d{8}$)|(^0[3-9] {1}\\d{2}-?\\d{7,8}$)|(^0[1,2]{1}\\d{1}-?\\d{8}-(\\d{1,4})$)|(^0[3-9]{1}\\d{2}-? \\d{7,8}-(\\d{1,4})$))";

    /**
     * 验证邮箱
     * 邮箱的地址规则：数字、字母、下划线 + @ + 数字、英文 + . +英文（长度是2-4）
     */
    public static final String REGEX_EMAIL = "^([a-z0-9A-Z]+[-|\\.]?)+[a-z0-9A-Z]@([a-z0-9A-Z]+(-[a-z0-9A-Z]+)?\\.)+[a-zA-Z]{2,}$";

    /**
     * 验证汉字(1-9个汉字)  {1,9} 自定义区间
     * "[\\p{InCJK Unified Ideographs}&&\\P{Cn}]]"
     */
    public static final String REGEX_CHINESE = "^[\u4e00-\u9fa5]{1,9}$";

    /**
     * 正则表达式:验证身份证
     */
    public static final String REGEX_ID_CARD = "(\\d{14}[0-9a-zA-Z])|(\\d{17}[0-9a-zA-Z])";

    /**
     * 正则表达式:验证URL
     */
    public static final String REGEX_URL = "http(s)?://([\\w-]+\\.)+[\\w-]+(/[\\w- ./?%&=]*)?";

    /**
     * 正则表达式:验证IP地址
     */
    public static final String REGEX_IP_ADDR = "(2[5][0-5]|2[0-4]\\d|1\\d{2}|\\d{1,2})\\.(25[0-5]|2[0-4]\\d|1\\d{2}|\\d{1,2})\\.(25[0-5]|2[0-4]\\d|1\\d{2}|\\d{1,2})\\.(25[0-5]|2[0-4]\\d|1\\d{2}|\\d{1,2})";

}
